#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0b3016976940854f2]
aws_cloudwatch_log_group.log-group: Refreshing state... [id=tune-train-prod-logs]
aws_ecs_cluster.aws-ecs-cluster: Refreshing state... [id=arn:aws:ecs:us-east-2:516207173224:cluster/tune-train-prod-cluster]
aws_ecr_repository.tune-train: Refreshing state... [id=tune-train-repo-prod]
data.aws_ami.aws_optimized_ecs: Reading...
data.aws_iam_policy_document.ecs_agent: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-013f184cf808d1fec]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0a9b01dbf682872c0]
data.aws_iam_policy_document.ecs_agent: Read complete after 0s [id=320642683]
aws_iam_role.ecs_agent: Refreshing state... [id=tune-train-execution-task-role]
data.aws_ami.aws_optimized_ecs: Read complete after 1s [id=ami-0f8d9a31a1b32f6a1]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-064c2c8470161976a]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-08e8fc4b8d38d5795]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0c05c4efc4c3615c3]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-029791e1bc4fde651]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-054e0d96b0912fb00]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0ea245a5ca73c036b]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0bbaec7f03bf0091d]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-08a4a4e9ec1ac9f28]
aws_iam_instance_profile.ecs_agent: Refreshing state... [id=ecs-agent]
aws_iam_role_policy_attachment.ecs_agent: Refreshing state... [id=tune-train-execution-task-role-20220830060208705400000001]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0960db45de59ec722]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-09450d865c9517673]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-08e8fc4b8d38d57951080289494]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-07a3eb097ed77657e]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-073df7f6822d3c460]
aws_launch_configuration.tune-train-launch-config: Refreshing state... [id=tune-train20220830060208986400000002]
aws_db_subnet_group.tune-train-db-subnet-group: Refreshing state... [id=tune-train-db-subnet-group]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0403692fc92e811c9]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-02ffd3022b3c4fe94]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0ea245a5ca73c036b1080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-054e0d96b0912fb001080289494]
aws_db_instance.tune-train: Refreshing state... [id=tune-train-prod]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_autoscaling_group.tune-train-asg will be created
  + resource "aws_autoscaling_group" "tune-train-asg" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = 30
      + desired_capacity          = (known after apply)
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 30
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + launch_configuration      = "tune-train"
      + max_size                  = 2
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = (known after apply)
      + name_prefix               = "tune-train"
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + termination_policies      = [
          + "OldestInstance",
        ]
      + vpc_zone_identifier       = [
          + "vpc-013f184cf808d1fec",
        ]
      + wait_for_capacity_timeout = "10m"
    }

  # aws_ecs_task_definition.task_definition will be created
  + resource "aws_ecs_task_definition" "task_definition" {
      + arn                   = (known after apply)
      + container_definitions = jsonencode(
            [
              + {
                  + cpu          = 512
                  + essential    = true
                  + image        = "516207173224.dkr.ecr.us-east-2.amazonaws.com/tune-train-repo-prod:35f786658ef3777f230e20afd2df50c01dae1a18"
                  + memory       = 1024
                  + name         = "tune-train-prod"
                  + portMappings = [
                      + {
                          + containerPort = 80
                          + hostPort      = 80
                        },
                    ]
                },
            ]
        )
      + cpu                   = "512"
      + execution_role_arn    = "arn:aws:iam::516207173224:role/ecsTaskExecutionRole"
      + family                = "tune-train-prod"
      + id                    = (known after apply)
      + memory                = "1024"
      + network_mode          = (known after apply)
      + revision              = (known after apply)
      + skip_destroy          = false
      + tags                  = {
          + "Name"      = "tune-train-prod"
          + "managedBy" = "terraform"
          + "service"   = "tune-train"
          + "stage"     = "prod"
        }
      + tags_all              = {
          + "Name"      = "tune-train-prod"
          + "managedBy" = "terraform"
          + "service"   = "tune-train"
          + "stage"     = "prod"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @ericvtheg, Action: `pull_request`, Working Directory: ``, Workflow: `Deploy Infrastructure & Container`*